BitNibble/STM32G473VET6/STM32G473VET6_3/lib/src/usart_irq.c
        if (irq()->uart->uart4->tc != NULL)
        {
            irq()->uart->uart4->tc();
        }
        else
        {
            uart4_tc_callback();
        }
    }

    /* Character Match */
    if (isr & USART_ISR_CMF)
    {
        UART4->ICR = USART_ICR_CMCF;

        if (irq()->uart->uart4->cmf != NULL)
        {
            irq()->uart->uart4->cmf();
        }
        else
        {
            uart4_cmf_callback();
        }
    }

    /* Receiver Timeout */
    if (isr & USART_ISR_RTOF)
    {
        UART4->ICR = USART_ICR_RTOCF;

        if (irq()->uart->uart4->rtof != NULL)
        {
            irq()->uart->uart4->rtof();
        }
        else
        {
            uart4_rtof_callback();
        }
    }

    /* End Of Block */
    if (isr & USART_ISR_EOBF)
    {
        UART4->ICR = USART_ICR_EOBCF;

        if (irq()->uart->uart4->eob != NULL)
        {
            irq()->uart->uart4->eob();
        }
        else
        {
            uart4_eob_callback();
        }
    }

    /* CTS */
    if (isr & USART_ISR_CTSIF)
    {
        UART4->ICR = USART_ICR_CTSCF;

        if (irq()->uart->uart4->cts != NULL)
        {
            irq()->uart->uart4->cts();
        }
        else
        {
            uart4_cts_callback();
        }
    }

    /* Wakeup from Stop */
    if (isr & USART_ISR_WUF)
    {
        UART4->ICR = USART_ICR_WUCF;

        if (irq()->uart->uart4->wuf != NULL)
        {
            irq()->uart->uart4->wuf();
        }
        else
        {
            uart4_wuf_callback();
        }
    }
}

void UART5_IRQHandler(void)
{
    uint32_t isr = UART5->ISR;

    // Parity Error
    if (isr & USART_ISR_PE)
    {
        UART5->ICR = USART_ICR_PECF;

        if (irq()->uart->uart5->pe != NULL)
        {
            irq()->uart->uart5->pe();
        }
        else
        {
            uart5_pe_callback();
        }
    }

    // Framing Error
    if (isr & USART_ISR_FE)
    {
        UART5->ICR = USART_ICR_FECF;

        if (irq()->uart->uart5->fe != NULL)
        {
            irq()->uart->uart5->fe();
        }
        else
        {
            uart5_fe_callback();
        }
    }

    // Noise Error
    if (isr & USART_ISR_NE)
    {
        UART5->ICR = USART_ICR_NECF;

        if (irq()->uart->uart5->ne != NULL)
        {
            irq()->uart->uart5->ne();
        }
        else
        {
            uart5_ne_callback();
        }
    }

    // Overrun Error
    if (isr & USART_ISR_ORE)
    {
        UART5->ICR = USART_ICR_ORECF;

        if (irq()->uart->uart5->ore != NULL)
        {
            irq()->uart->uart5->ore();
        }
        else
        {
            uart5_ore_callback();
        }
    }

    // Idle Line
    if (isr & USART_ISR_IDLE)
    {
        UART5->ICR = USART_ICR_IDLECF;

        if (irq()->uart->uart5->idle != NULL)
        {
            irq()->uart->uart5->idle();
        }
        else
        {
            uart5_idle_callback();
        }
    }

    // RX Not Empty
    if (isr & USART_ISR_RXNE_RXFNE)
    {
        if (irq()->uart->uart5->rxne != NULL)
        {
            irq()->uart->uart5->rxne();
        }
        else
        {
            uart5_rxne_callback();
        }
    }

    // TX Empty
    if (isr & USART_ISR_TXE_TXFNF)
    {
        if (irq()->uart->uart5->txe != NULL)
        {
            irq()->uart->uart5->txe();
        }
        else
        {
            uart5_txe_callback();
        }
    }

    // Transmission Complete
    if (isr & USART_ISR_TC)
    {
        UART5->ICR = USART_ICR_TCCF;

        if (irq()->uart->uart5->tc != NULL)
        {
            irq()->uart->uart5->tc();
        }
        else
        {
            uart5_tc_callback();
        }
    }

    // Character Match
    if (isr & USART_ISR_CMF)
    {
        UART5->ICR = USART_ICR_CMCF;

        if (irq()->uart->uart5->cmf != NULL)
        {
            irq()->uart->uart5->cmf();
        }
        else
        {
            uart5_cmf_callback();
        }
    }

    // Receiver Timeout
    if (isr & USART_ISR_RTOF)
    {
        UART5->ICR = USART_ICR_RTOCF;

        if (irq()->uart->uart5->rtof != NULL)
        {
            irq()->uart->uart5->rtof();
        }
        else
        {
            uart5_rtof_callback();
        }
    }

    // End Of Block
    if (isr & USART_ISR_EOBF)
    {
        UART5->ICR = USART_ICR_EOBCF;

        if (irq()->uart->uart5->eob != NULL)
        {
            irq()->uart->uart5->eob();
        }
        else
        {
            uart5_eob_callback();
        }
    }

    // CTS
    if (isr & USART_ISR_CTSIF)
    {
        UART5->ICR = USART_ICR_CTSCF;

        if (irq()->uart->uart5->cts != NULL)
        {
            irq()->uart->uart5->cts();
        }
        else
        {
            uart5_cts_callback();
        }
    }

    // Wakeup from Stop
    if (isr & USART_ISR_WUF)
    {
        UART5->ICR = USART_ICR_WUCF;

        if (irq()->uart->uart5->wuf != NULL)
        {
            irq()->uart->uart5->wuf();
        }
        else
        {
            uart5_wuf_callback();
        }
    }
}

void LPUART1_IRQHandler(void)
{
    uint32_t isr = LPUART1->ISR;

    // Parity Error
    if (isr & USART_ISR_PE)
    {
        LPUART1->ICR = USART_ICR_PECF;

        if (irq()->uart->lpuart1->pe != NULL)
        {
            irq()->uart->lpuart1->pe();
        }
        else
        {
            lpuart1_pe_callback();
        }
    }

    // Framing Error
    if (isr & USART_ISR_FE)
    {
        LPUART1->ICR = USART_ICR_FECF;

        if (irq()->uart->lpuart1->fe != NULL)
        {
            irq()->uart->lpuart1->fe();
        }
        else
        {
            lpuart1_fe_callback();
        }
    }

    // Noise Error
    if (isr & USART_ISR_NE)
    {
        LPUART1->ICR = USART_ICR_NECF;

        if (irq()->uart->lpuart1->ne != NULL)
        {
            irq()->uart->lpuart1->ne();
        }
        else
        {
            lpuart1_ne_callback();
        }
    }

    // Overrun Error
    if (isr & USART_ISR_ORE)
    {
        LPUART1->ICR = USART_ICR_ORECF;

        if (irq()->uart->lpuart1->ore != NULL)
        {
            irq()->uart->lpuart1->ore();
        }
        else
        {
            lpuart1_ore_callback();
        }
    }

    // Idle Line
    if (isr & USART_ISR_IDLE)
    {
        LPUART1->ICR = USART_ICR_IDLECF;

        if (irq()->uart->lpuart1->idle != NULL)
        {
            irq()->uart->lpuart1->idle();
        }
        else
        {
            lpuart1_idle_callback();
        }
    }

