BitNibble/STM32G473VET6/STM32G473VET6_3/lib/src/usart_irq.c
    // RX Not Empty
    if (isr & USART_ISR_RXNE_RXFNE)
    {
        if (irq()->uart->lpuart1->rxne != NULL)
        {
            irq()->uart->lpuart1->rxne();
        }
        else
        {
            lpuart1_rxne_callback();
        }
    }

    // TX Empty
    if (isr & USART_ISR_TXE_TXFNF)
    {
        if (irq()->uart->lpuart1->txe != NULL)
        {
            irq()->uart->lpuart1->txe();
        }
        else
        {
            lpuart1_txe_callback();
        }
    }

    // Transmission Complete
    if (isr & USART_ISR_TC)
    {
        LPUART1->ICR = USART_ICR_TCCF;

        if (irq()->uart->lpuart1->tc != NULL)
        {
            irq()->uart->lpuart1->tc();
        }
        else
        {
            lpuart1_tc_callback();
        }
    }

    // Character Match
    if (isr & USART_ISR_CMF)
    {
        LPUART1->ICR = USART_ICR_CMCF;

        if (irq()->uart->lpuart1->cmf != NULL)
        {
            irq()->uart->lpuart1->cmf();
        }
        else
        {
            lpuart1_cmf_callback();
        }
    }

    // Receiver Timeout
    if (isr & USART_ISR_RTOF)
    {
        LPUART1->ICR = USART_ICR_RTOCF;

        if (irq()->uart->lpuart1->rtof != NULL)
        {
            irq()->uart->lpuart1->rtof();
        }
        else
        {
            lpuart1_rtof_callback();
        }
    }

    // End Of Block
    if (isr & USART_ISR_EOBF)
    {
        LPUART1->ICR = USART_ICR_EOBCF;

        if (irq()->uart->lpuart1->eob != NULL)
        {
            irq()->uart->lpuart1->eob();
        }
        else
        {
            lpuart1_eob_callback();
        }
    }

    // CTS
    if (isr & USART_ISR_CTSIF)
    {
        LPUART1->ICR = USART_ICR_CTSCF;

        if (irq()->uart->lpuart1->cts != NULL)
        {
            irq()->uart->lpuart1->cts();
        }
        else
        {
            lpuart1_cts_callback();
        }
    }

    // Wake up from Stop
    if (isr & USART_ISR_WUF)
    {
        LPUART1->ICR = USART_ICR_WUCF;

        if (irq()->uart->lpuart1->wuf != NULL)
        {
            irq()->uart->lpuart1->wuf();
        }
        else
        {
            lpuart1_wuf_callback();
        }
    }
}

/*** EOF ***/

